---
type: RoomFilter
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 2
tags: [revit-api, class]
---

# RoomFilter

`Autodesk.Revit.DB.Architecture.RoomFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RoomFilter | — | `public RoomFilter ()` |
| Method | PassesFilter | — | `` |